In [2]:
""" Import module für alle Fälle"""
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd

from ipywidgets import interact
from ipywidgets import IntSlider, FloatSlider, Dropdown, FloatText

In [3]:
""" csv in Data Frame umwandeln - nicht weiterverfolgen wird von anderem Team Mitglied erledigt"""
shop_eu = pd.read_csv("Daten_Aufgabe_1 - Shopauswertung.csv")
shop_eu= pd.DataFrame(shop_eu)

In [17]:
""" VERSUCH DIE Format wie unten per ipynb befehl zu erreichen 
    TO Do - hat nicht geklappt, später daran abarbeiten :)"""

# Blätternamen angeben
#blätter = ["P3","P2","P1"]

# DataFrame für jedes Blatt erstellen und in einer Liste speichern

#shop_1 = []
#for x in blätter:
    #df = pd.read_excel("Daten_Aufgabe_1 - Shop Analyse.xlsx")
    #shop_1.append(df)

# DataFrames zu einem einzigen DataFrame zusammenführen
#shop_de = pd.concat(shop_1, ignore_index=True)
#print(shop_de)

In [4]:
""" excel in Data Frame umwandeln - vorher excel vorbereitet als shop_de.xlsx."""
a = pd.read_excel("shop_de.xlsx")
shop_de = pd.DataFrame(a)
shop_de.head()

  Datum     Umsatz P1     Umsatz P2      Umsatz P3
0   Jan  15562.548244  14774.456985  148945.166650
1   Feb  14055.574404  15176.474454  128859.949494
2   Mrz  15633.906605  18280.334382  141602.709028
3   Apr  15792.846962  19095.318361  133780.491099
4   Mai  16947.490126  20206.106573  135993.779232

In [5]:
shop_de["Umsatz P1"] = round(shop_de["Umsatz P1"],2)
shop_de["Umsatz P2"] = round(shop_de["Umsatz P2"],2)
shop_de["Umsatz P3"] = round(shop_de["Umsatz P3"],2)
shop_de["Gesamt"] = shop_de["Umsatz P1"] + shop_de["Umsatz P2"] + shop_de["Umsatz P3"]

In [6]:
shop_de

   Datum  Umsatz P1  Umsatz P2  Umsatz P3     Gesamt
0    Jan   15562.55   14774.46  148945.17  179282.18
1    Feb   14055.57   15176.47  128859.95  158091.99
2    Mrz   15633.91   18280.33  141602.71  175516.95
3    Apr   15792.85   19095.32  133780.49  168668.66
4    Mai   16947.49   20206.11  135993.78  173147.38
5    Jun   17082.75   20056.65  135206.77  172346.17
6    Jul   17965.03   22288.14  143531.78  183784.95
7    Aug   17720.17   21707.81  139714.63  179142.61
8    Sep   16870.28   21084.84  130178.03  168133.15
9    Okt   17579.24   21564.91  128966.72  168110.87
10   Nov   17567.79   20566.41  122411.82  160546.02
11   Dez   18653.34   22364.24  126539.08  167556.66